-- MySQL dump 10.13  Distrib 5.6.23, for Win64 (x86_64)
--
-- Host: localhost    Database: pocc
-- ------------------------------------------------------
-- Server version	5.6.25-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `city`
--

DROP TABLE IF EXISTS `city`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `city` (
  `id` int(32) NOT NULL AUTO_INCREMENT,
  `province_id` tinyint(8) DEFAULT NULL,
  `city` varchar(16) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `province_id` (`province_id`)
) ENGINE=InnoDB AUTO_INCREMENT=345 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `city`
--

LOCK TABLES `city` WRITE;
/*!40000 ALTER TABLE `city` DISABLE KEYS */;
INSERT INTO `city` VALUES (5,3,'石家庄市'),(6,3,'唐山市'),(7,3,'秦皇岛市'),(8,3,'邯郸市'),(9,3,'邢台市'),(10,3,'保定市'),(11,3,'张家口市'),(12,3,'承德市'),(13,3,'沧州市'),(14,3,'廊坊市'),(15,3,'衡水市'),(16,4,'太原市'),(17,4,'大同市'),(18,4,'阳泉市'),(19,4,'长治市'),(20,4,'晋城市'),(21,4,'朔州市'),(22,4,'晋中市'),(23,4,'运城市'),(24,4,'忻州市'),(25,4,'临汾市'),(26,4,'吕梁市'),(27,5,'呼和浩特市'),(28,5,'包头市'),(29,5,'乌海市'),(30,5,'赤峰市'),(31,5,'通辽市'),(32,5,'鄂尔多斯市'),(33,5,'呼伦贝尔市'),(34,5,'巴彦淖尔市'),(35,5,'乌兰察布市'),(36,5,'兴安盟'),(37,5,'锡林郭勒盟'),(38,5,'阿拉善盟'),(39,6,'沈阳市'),(40,6,'大连市'),(41,6,'鞍山市'),(42,6,'抚顺市'),(43,6,'本溪市'),(44,6,'丹东市'),(45,6,'锦州市'),(46,6,'营口市'),(47,6,'阜新市'),(48,6,'辽阳市'),(49,6,'盘锦市'),(50,6,'铁岭市'),(51,6,'朝阳市'),(52,6,'葫芦岛市'),(53,7,'长春市'),(54,7,'吉林市'),(55,7,'四平市'),(56,7,'辽源市'),(57,7,'通化市'),(58,7,'白山市'),(59,7,'松原市'),(60,7,'白城市'),(61,7,'延边朝鲜族自治州'),(62,8,'哈尔滨市'),(63,8,'齐齐哈尔市'),(64,8,'鸡西市'),(65,8,'鹤岗市'),(66,8,'双鸭山市'),(67,8,'大庆市'),(68,8,'伊春市'),(69,8,'佳木斯市'),(70,8,'七台河市'),(71,8,'牡丹江市'),(72,8,'黑河市'),(73,8,'绥化市'),(74,8,'大兴安岭地区'),(77,10,'南京市'),(78,10,'无锡市'),(79,10,'徐州市'),(80,10,'常州市'),(81,10,'苏州市'),(82,10,'南通市'),(83,10,'连云港市'),(84,10,'淮安市'),(85,10,'盐城市'),(86,10,'扬州市'),(87,10,'镇江市'),(88,10,'泰州市'),(89,10,'宿迁市'),(90,11,'杭州市'),(91,11,'宁波市'),(92,11,'温州市'),(93,11,'嘉兴市'),(94,11,'湖州市'),(95,11,'绍兴市'),(96,11,'金华市'),(97,11,'衢州市'),(98,11,'舟山市'),(99,11,'台州市'),(100,11,'丽水市'),(101,12,'合肥市'),(102,12,'芜湖市'),(103,12,'蚌埠市'),(104,12,'淮南市'),(105,12,'马鞍山市'),(106,12,'淮北市'),(107,12,'铜陵市'),(108,12,'安庆市'),(109,12,'黄山市'),(110,12,'滁州市'),(111,12,'阜阳市'),(112,12,'宿州市'),(113,12,'巢湖市'),(114,12,'六安市'),(115,12,'亳州市'),(116,12,'池州市'),(117,12,'宣城市'),(118,13,'福州市'),(119,13,'厦门市'),(120,13,'莆田市'),(121,13,'三明市'),(122,13,'泉州市'),(123,13,'漳州市'),(124,13,'南平市'),(125,13,'龙岩市'),(126,13,'宁德市'),(127,14,'南昌市'),(128,14,'景德镇市'),(129,14,'萍乡市'),(130,14,'九江市'),(131,14,'新余市'),(132,14,'鹰潭市'),(133,14,'赣州市'),(134,14,'吉安市'),(135,14,'宜春市'),(136,14,'抚州市'),(137,14,'上饶市'),(138,15,'济南市'),(139,15,'青岛市'),(140,15,'淄博市'),(141,15,'枣庄市'),(142,15,'东营市'),(143,15,'烟台市'),(144,15,'潍坊市'),(145,15,'济宁市'),(146,15,'泰安市'),(147,15,'威海市'),(148,15,'日照市'),(149,15,'莱芜市'),(150,15,'临沂市'),(151,15,'德州市'),(152,15,'聊城市'),(153,15,'滨州市'),(154,15,'荷泽市'),(155,16,'郑州市'),(156,16,'开封市'),(157,16,'洛阳市'),(158,16,'平顶山市'),(159,16,'安阳市'),(160,16,'鹤壁市'),(161,16,'新乡市'),(162,16,'焦作市'),(163,16,'濮阳市'),(164,16,'许昌市'),(165,16,'漯河市'),(166,16,'三门峡市'),(167,16,'南阳市'),(168,16,'商丘市'),(169,16,'信阳市'),(170,16,'周口市'),(171,16,'驻马店市'),(172,17,'武汉市'),(173,17,'黄石市'),(174,17,'十堰市'),(175,17,'宜昌市'),(176,17,'襄樊市'),(177,17,'鄂州市'),(178,17,'荆门市'),(179,17,'孝感市'),(180,17,'荆州市'),(181,17,'黄冈市'),(182,17,'咸宁市'),(183,17,'随州市'),(184,17,'恩施土家族苗族自治州'),(186,18,'长沙市'),(187,18,'株洲市'),(188,18,'湘潭市'),(189,18,'衡阳市'),(190,18,'邵阳市'),(191,18,'岳阳市'),(192,18,'常德市'),(193,18,'张家界市'),(194,18,'益阳市'),(195,18,'郴州市'),(196,18,'永州市'),(197,18,'怀化市'),(198,18,'娄底市'),(199,18,'湘西土家族苗族自治州'),(200,19,'广州市'),(201,19,'韶关市'),(202,19,'深圳市'),(203,19,'珠海市'),(204,19,'汕头市'),(205,19,'佛山市'),(206,19,'江门市'),(207,19,'湛江市'),(208,19,'茂名市'),(209,19,'肇庆市'),(210,19,'惠州市'),(211,19,'梅州市'),(212,19,'汕尾市'),(213,19,'河源市'),(214,19,'阳江市'),(215,19,'清远市'),(216,19,'东莞市'),(217,19,'中山市'),(218,19,'潮州市'),(219,19,'揭阳市'),(220,19,'云浮市'),(221,20,'南宁市'),(222,20,'柳州市'),(223,20,'桂林市'),(224,20,'梧州市'),(225,20,'北海市'),(226,20,'防城港市'),(227,20,'钦州市'),(228,20,'贵港市'),(229,20,'玉林市'),(230,20,'百色市'),(231,20,'贺州市'),(232,20,'河池市'),(233,20,'来宾市'),(234,20,'崇左市'),(235,21,'海口市'),(236,21,'三亚市'),(241,23,'成都市'),(242,23,'自贡市'),(243,23,'攀枝花市'),(244,23,'泸州市'),(245,23,'德阳市'),(246,23,'绵阳市'),(247,23,'广元市'),(248,23,'遂宁市'),(249,23,'内江市'),(250,23,'乐山市'),(251,23,'南充市'),(252,23,'眉山市'),(253,23,'宜宾市'),(254,23,'广安市'),(255,23,'达州市'),(256,23,'雅安市'),(257,23,'巴中市'),(258,23,'资阳市'),(259,23,'阿坝藏族羌族自治州'),(260,23,'甘孜藏族自治州'),(261,23,'凉山彝族自治州'),(262,24,'贵阳市'),(263,24,'六盘水市'),(264,24,'遵义市'),(265,24,'安顺市'),(266,24,'铜仁市'),(267,24,'黔西南布依族苗族自治州'),(268,24,'毕节市'),(269,24,'黔东南苗族侗族自治州'),(270,24,'黔南布依族苗族自治州'),(271,25,'昆明市'),(272,25,'曲靖市'),(273,25,'玉溪市'),(274,25,'保山市'),(275,25,'昭通市'),(276,25,'丽江市'),(277,25,'思茅市'),(278,25,'临沧市'),(279,25,'楚雄彝族自治州'),(280,25,'红河哈尼族彝族自治州'),(281,25,'文山壮族苗族自治州'),(282,25,'西双版纳傣族自治州'),(283,25,'大理白族自治州'),(284,25,'德宏傣族景颇族自治州'),(285,25,'怒江傈僳族自治州'),(286,25,'迪庆藏族自治州'),(287,26,'拉萨市'),(288,26,'昌都地区'),(289,26,'山南地区'),(290,26,'日喀则地区'),(291,26,'那曲地区'),(292,26,'阿里地区'),(293,26,'林芝地区'),(294,27,'西安市'),(295,27,'铜川市'),(296,27,'宝鸡市'),(297,27,'咸阳市'),(298,27,'渭南市'),(299,27,'延安市'),(300,27,'汉中市'),(301,27,'榆林市'),(302,27,'安康市'),(303,27,'商洛市'),(304,28,'兰州市'),(305,28,'嘉峪关市'),(306,28,'金昌市'),(307,28,'白银市'),(308,28,'天水市'),(309,28,'武威市'),(310,28,'张掖市'),(311,28,'平凉市'),(312,28,'酒泉市'),(313,28,'庆阳市'),(314,28,'定西市'),(315,28,'陇南市'),(316,28,'临夏回族自治州'),(317,28,'甘南藏族自治州'),(318,29,'西宁市'),(319,29,'海东地区'),(320,29,'海北藏族自治州'),(321,29,'黄南藏族自治州'),(322,29,'海南藏族自治州'),(323,29,'果洛藏族自治州'),(324,29,'玉树藏族自治州'),(325,29,'海西蒙古族藏族自治州'),(326,30,'银川市'),(327,30,'石嘴山市'),(328,30,'吴忠市'),(329,30,'固原市'),(330,30,'中卫市'),(331,31,'乌鲁木齐市'),(332,31,'克拉玛依市'),(333,31,'吐鲁番地区'),(334,31,'哈密地区'),(335,31,'昌吉回族自治州'),(336,31,'博尔塔拉蒙古自治州'),(337,31,'巴音郭楞蒙古自治州'),(338,31,'阿克苏地区'),(339,31,'克孜勒苏柯尔克孜自治州'),(340,31,'喀什地区'),(341,31,'和田地区'),(342,31,'伊犁哈萨克自治州'),(343,31,'塔城地区'),(344,31,'阿勒泰地区');
/*!40000 ALTER TABLE `city` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2015-08-18 19:51:02
